app/controllers/users_controller.rb

  def index
    #@users =  User.all
    @users = User.where(activated: true).page(params[:page]).per(10)
---
SELECT "users".* FROM "users" WHERE "users"."activated" = ? LIMIT ? OFFSET ?  [["activated", 1], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE "users"."activated" = ?  [["activated", 1]]

     def correct_user
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]