app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def index
    #@users =  User.all
    @users = User.page(params[:page]).per(10)

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "remember_digest") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
     def correct_user
      @user = User.find(params[:id])